000100191120     A          R TOLLINFO
000101191120     A                                  2 71DATE
000102191120     A                                      EDTCDE(Y)
000103191120     A                                  3 24'H I G H W A Y     4 0 8     T O L -
000104191120     A                                      L S'
000105191120     A                                  4 35'Trip Information'
000106191120     A                                  5  9'Kilometers traveled:'
000107191120     A                                  6  9'Type of vehicle:'
000108191120     A                                  7  9'Time of Day:'
000109191120     A                                  9  9'Transponder:'
000110191120     A                                  2  3USER
000111191120     A                                  6 37'(L - Light, H - Heavy, M - Multipl-
000112191120     A                                      e Heavy)'
000113191120     A                                  7 37'(0 - 12)'
000114191120     A                                  7 58'(AM or PM)'
000115191120     A                                  9 37'(Y or N)'
000116191120     A            KILOMETERS     3  0B  5 31RANGE(0 999)
000117191120     A  99                                  DSPATR(PR)
000118191120     A            VEHICLE        1   B  6 31VALUES('L' 'H' 'M')
000119191120     A            HOUR           2  0B  7 31RANGE(1 12)
000120191120     A            AMPM           2   B  7 51VALUES('AM' 'PM')
000121191120     A            TRANSPDR       1A  B  9 31VALUES('Y' 'N')
000122191120     A          R SHOWTOLL                  CA03(03)
000123191120     A                                      OVERLAY
000124191120     A                                 12 26'Applicable Toll Charges'
000125191120     A                                 13 16'Toll Rate:'
000126191120     A                                 14 14'Toll Charge:'
000127191120     A                                 15  4'No Transponder Charge:'
000128191120     A                                 17  9'T O T A L  C H A R G E:'
000129191120     A            TOLLRATE       5Y 4O 13 40EDTCDE(1 $)
000130191120     A            TOLLCHARGE     5Y 2O 14 40EDTCDE(1 $)
000131191120     A            NOTRANSP       4  2O 15 40EDTCDE(1)
000132191120     A            TOTALDUE       5  2O 17 40EDTWRD('   .  ')
000133191120     A                                 19  4'F3 - Exit'
